ros2/freertps/stm32/enet.c
#include "enet.h"
#include "stm32f427xx.h"
#include <stdio.h>
#include <string.h>
#include "systime.h"
#include "delay.h"
#include "pin.h"
#include "led.h"

// declare the pin numbers
#define PORTA_ETH_REFCLK 1
#define PORTA_ETH_MDIO   2
#define PORTA_PHY_RESET  4 
#define PORTA_ETH_CRSDV  7
#define PORTB_ETH_TXEN   11
#define PORTB_ETH_TXD0   12
#define PORTB_ETH_TXD1   13
#define PORTC_ETH_MDC    1
#define PORTC_ETH_RXD0   4
#define PORTC_ETH_RXD1   5

#define PORTE_ETH_GREEN_LED  12
#define PORTE_ETH_YELLOW_LED 13

#define AF_ENET 11

// address is hard-wired on board 
#define ENET_PHY_ADDR 0x00

#define ETH_NBUF     2048
#define ETH_DMA_NRXD   16
#define ETH_DMA_NTXD    4

// hard-coded ip for now... 10.66.177.89
#ifndef ETH_IP_ADDR
  #define ETH_IP_ADDR 0x0a42b159
#endif

// todo: find ways for this to be overridden on CPU's with built-ins for this
uint16_t eth_htons(const uint16_t x)
{
  return ((x & 0xff) << 8) | ((x >> 8) & 0xff);
}

uint32_t eth_htonl(const uint32_t x)
{
  return ((x & 0x000000ff) << 24)  |
         ((x & 0x0000ff00) << 8)   |
         ((x & 0x00ff0000) >> 8)   |
         ((x & 0xff000000) >> 24);
}


uint32_t g_host_ip_addr = 0x0a42b164; // TODO: overwrite this intelligently

// todo: parameterize this nicely for a makefile
static const uint8_t s_enet_mac[6] = { 0xa4, 0xf3, 0xc1, 0x0, 0x1, 0x1 };
static uint8_t g_enet_master_mac[6] = {0};
static bool g_enet_arp_valid = false;

typedef struct
{
  uint32_t des0;
  uint32_t des1;
  uint32_t des2;
  uint32_t des3;
} eth_dma_desc_t;

#define ALIGN4 __attribute__((aligned(4)));

static volatile eth_dma_desc_t g_eth_dma_rx_desc[ETH_DMA_NRXD] ALIGN4;
static volatile eth_dma_desc_t g_eth_dma_tx_desc[ETH_DMA_NTXD] ALIGN4;
static volatile uint8_t g_eth_dma_rx_buf[ETH_DMA_NRXD][ETH_NBUF] ALIGN4;
static volatile uint8_t g_eth_dma_tx_buf[ETH_DMA_NTXD][ETH_NBUF] ALIGN4;
static volatile eth_dma_desc_t *g_eth_dma_rx_next_desc = &g_eth_dma_rx_desc[0];
static volatile eth_dma_desc_t *g_eth_dma_tx_next_desc = &g_eth_dma_tx_desc[0];

#define ETH_RAM_RXPOOL_LEN  16384
#define ETH_RAM_RXPOOL_NPTR   128
static volatile uint8_t  g_eth_rxpool[ETH_RAM_RXPOOL_LEN] ALIGN4;
static volatile uint16_t g_eth_rxpool_wpos = 0;
static volatile uint8_t *g_eth_rxpool_start[ETH_RAM_RXPOOL_NPTR] ALIGN4;
static volatile uint16_t g_eth_rxpool_len[ETH_RAM_RXPOOL_NPTR] ALIGN4;
static volatile uint16_t g_eth_rxpool_ptrs_wpos = 0;
static volatile uint16_t g_eth_rxpool_ptrs_rpos = 0;

///////////////////////////////////////////////////////////////////////////
// local functions
static void eth_send_raw_packet(uint8_t *pkt, uint16_t pkt_len);
static bool eth_dispatch_eth(const uint8_t *data, const uint16_t len);
static bool eth_dispatch_ip(const uint8_t *data, const uint16_t len);
static bool eth_dispatch_udp(const uint8_t *data, const uint16_t len);
static bool eth_dispatch_arp(const uint8_t *data, const uint16_t len);
static bool eth_dispatch_icmp(uint8_t *data, const uint16_t len);

///////////////////////////////////////////////////////////////////////////

uint16_t enet_read_phy_reg(const uint8_t reg_idx)
{
  while (ETH->MACMIIAR & ETH_MACMIIAR_MB) { } // ensure MII is idle
  ETH->MACMIIAR = (ENET_PHY_ADDR << 11) | 
                  ((reg_idx & 0x1f) << 6) |
                  ETH_MACMIIAR_CR_Div102  | // clock divider
                  ETH_MACMIIAR_MB; 
  while (ETH->MACMIIAR & ETH_MACMIIAR_MB) { } // spin waiting for MII to finish
  return ETH->MACMIIDR & 0xffff;
}

void enet_write_phy_reg(const uint8_t reg_idx, const uint16_t reg_val)
{
  while (ETH->MACMIIAR & ETH_MACMIIAR_MB) { } // ensure MII is idle
  ETH->MACMIIDR = reg_val; // set the outgoing data word
  ETH->MACMIIAR = (ENET_PHY_ADDR << 11)   |
                  ((reg_idx & 0x1f) << 6) |
                  ETH_MACMIIAR_CR_Div102  | // MDC clock divider
                  ETH_MACMIIAR_MW         | // set the write bit
                  ETH_MACMIIAR_MB; // start it up
  while (ETH->MACMIIAR & ETH_MACMIIAR_MB) { } // spin waiting for MII to finish
  uint16_t readback_val = enet_read_phy_reg(reg_idx);
  if (readback_val != reg_val)
  {
    printf("woah there. tried to write 0x%04x to reg %02d but it read back %04x\r\n",
           reg_val, reg_idx, readback_val);
  }
}

void enet_init()
{
  printf("enet_init()\r\n");
  // set up the pins on port a
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN     |  // and all the i/o ports we 
                  RCC_AHB1ENR_GPIOBEN     |  // will be using to talk to
                  RCC_AHB1ENR_GPIOCEN     |  // the ethernet PHY
                  RCC_AHB1ENR_GPIOEEN     ;

  pin_set_alternate_function(GPIOA, PORTA_ETH_REFCLK, AF_ENET);
  pin_set_alternate_function(GPIOA, PORTA_ETH_MDIO  , AF_ENET);
  pin_set_alternate_function(GPIOA, PORTA_ETH_CRSDV , AF_ENET);

  pin_set_alternate_function(GPIOB, PORTB_ETH_TXEN  , AF_ENET);
  pin_set_alternate_function(GPIOB, PORTB_ETH_TXD0  , AF_ENET);
  pin_set_alternate_function(GPIOB, PORTB_ETH_TXD1  , AF_ENET);

  pin_set_alternate_function(GPIOC, PORTC_ETH_MDC   , AF_ENET);
  pin_set_alternate_function(GPIOC, PORTC_ETH_RXD0  , AF_ENET);
  pin_set_alternate_function(GPIOC, PORTC_ETH_RXD1  , AF_ENET);

  pin_set_output_speed(GPIOB, PORTB_ETH_TXEN, 3); // max beef
  pin_set_output_speed(GPIOB, PORTB_ETH_TXD0, 3); // max beef
  pin_set_output_speed(GPIOB, PORTB_ETH_TXD1, 3); // max beef

  pin_set_output(GPIOA, PORTA_PHY_RESET, 1);

  pin_set_output(GPIOE, PORTE_ETH_GREEN_LED, 0);
  pin_set_output(GPIOE, PORTE_ETH_YELLOW_LED, 0);

  RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN; // enable the sysconfig block
  RCC->AHB1RSTR |= RCC_AHB1RSTR_ETHMACRST;
  for (volatile int i = 0; i < 1000; i++) { } // wait for sysconfig to come up
  // hold the MAC in reset while we set it to RMII mode
  for (volatile int i = 0; i < 1000; i++) { } // wait for sysconfig to come up
  SYSCFG->PMC |= SYSCFG_PMC_MII_RMII_SEL; // set the MAC in RMII mode  
  for (volatile int i = 0; i < 100000; i++) { } // wait for sysconfig to come up
  RCC->AHB1ENR |= RCC_AHB1ENR_ETHMACRXEN  |
                  RCC_AHB1ENR_ETHMACTXEN  |
                  RCC_AHB1ENR_ETHMACEN    ;  // turn on ur ethernet plz
  for (volatile int i = 0; i < 100000; i++) { } // wait 
  RCC->AHB1RSTR &= ~RCC_AHB1RSTR_ETHMACRST; // release MAC reset
  for (volatile int i = 0; i < 100000; i++) { } // wait 
  RCC->AHB1RSTR |= RCC_AHB1RSTR_ETHMACRST;
  for (volatile int i = 0; i < 100000; i++) { } // wait 
  RCC->AHB1RSTR &= ~RCC_AHB1RSTR_ETHMACRST; // release MAC reset
  for (volatile int i = 0; i < 100000; i++) { } // wait for sysconfig ... (?)

  ETH->DMABMR |= ETH_DMABMR_SR;
  for (volatile uint32_t i = 0; i < 100000; i++) { } 
  while (ETH->DMABMR & ETH_DMABMR_SR) { } // wait for it to reset
  for (volatile uint32_t i = 0; i < 100000; i++) { } 
  ETH->DMAOMR |= ETH_DMAOMR_FTF; // flush DMA
  while (ETH->DMAOMR & ETH_DMAOMR_FTF) { } // wait for it to flush

  // now, configure the ethernet peripheral
  ETH->MACCR |= 0x02000000 | // CSTF = strip FCS. why isn't there a symbol ?
                ETH_MACCR_FES  | // enable 100 mbit mode
                ETH_MACCR_DM   | // full duplex
                ETH_MACCR_IPCO | // ipv4 checksum auto-generation for RX
                ETH_MACCR_APCS;  // automatically remove pad+CRC from frames
  ETH->MACFFR |= ETH_MACFFR_RA; // for now, don't try to filter in hardware
  // generate a decent reset pulse now
  pin_set_output_state(GPIOA, PORTA_PHY_RESET, 1);
  delay_ms(100);
  pin_set_output_state(GPIOA, PORTA_PHY_RESET, 0);
  delay_ms(200);
  pin_set_output_state(GPIOA, PORTA_PHY_RESET, 1);
  delay_ms(500);
  // todo: only need to wait until registers read back something other
  // than 0xffff . then we don't have to wait as long.
  for (volatile uint32_t i = 0; i < 1000000; i++) { } // let it initialize
  printf("waiting for PHY to wake up...\r\n");
  while (enet_read_phy_reg(0) == 0xffff) { }
  delay_ms(500);
  //for (volatile uint32_t i = 0; i < 1000000; i++) { } // let it initialize
  printf("done with PHY reset.\r\n");
  //printf("setting software strap registers...\r\n");
  /*
  enet_write_phy_reg(0x09, 0x7821); // enable auto MDIX,
                                    // set INT/PWDN to be interrupt output
                                    // enable auto-negotiation
  enet_write_phy_reg(0x09, 0xf821); // exit software-strap mode
  enet_write_phy_reg(0x04, 0x0101); // only advertise 100-FD mode
  */

