ros2/freertps/stm32/enet.c
#define ETH_ETHERTYPE_IP    0x0800
#define ETH_ETHERTYPE_ARP   0x0806

typedef struct
{
  eth_eth_header_t eth;
  uint8_t  header_len   :  4;
  uint8_t  version      :  4;
  uint8_t  ecn          :  2;
  uint8_t  diff_serv    :  6;
  uint16_t len          : 16;
  uint16_t id           : 16;
  uint16_t flag_frag    : 16;
  uint8_t  ttl          :  8;
  uint8_t  proto        :  8;
  uint16_t checksum     : 16;
  uint32_t source_addr  : 32;
  uint32_t dest_addr    : 32;
} __attribute__((packed)) eth_ip_header_t;

#define ETH_IP_HEADER_LEN     5
#define ETH_IP_VERSION        4
#define ETH_IP_DONT_FRAGMENT  0x4000

#define ETH_IP_PROTO_ICMP  0x01
#define ETH_IP_PROTO_UDP   0x11

typedef struct
{
  eth_ip_header_t ip;
  uint16_t source_port;
  uint16_t dest_port;
  uint16_t len;
  uint16_t checksum;
} __attribute__((packed)) eth_udp_header_t;

typedef struct
{
  eth_eth_header_t eth;
  uint16_t hw_type;
  uint16_t proto_type;
  uint8_t  hw_addr_len;
  uint8_t  proto_addr_len;
  uint16_t operation;
  uint8_t  sender_hw_addr[6];
  uint32_t sender_proto_addr;
  uint8_t  target_hw_addr[6];
  uint32_t target_proto_addr;
} __attribute__((packed)) eth_arp_pkt_t;
#define ETH_ETHERTYPE_ARP 0x0806
#define ETH_ARP_HW_ETHERNET 1
#define ETH_ARP_PROTO_IPV4 0x0800
#define ETH_ARP_OP_REQUEST 1
#define ETH_ARP_OP_RESPONSE 2

#define ICMP_MAX_DATA 200
typedef struct
{
  eth_ip_header_t ip;
  uint8_t  type;
  uint8_t  code;
  uint16_t checksum;
  uint16_t id;
  uint16_t sequence;
} __attribute__((packed)) enet_icmp_header_t;
static const uint8_t ENET_ICMP_ECHO_REPLY   = 0x00;
static const uint8_t ENET_ICMP_ECHO_REQUEST = 0x08;

static uint8_t  g_eth_udpbuf[1500] __attribute__((aligned(8))) = {0};

void enet_send_udp_mcast(const uint32_t mcast_ip, const uint16_t mcast_port,
                         const uint8_t *payload, const uint16_t payload_len)
{
  uint8_t dest_mac[6] = { 0x01, 0x00, 0x5e, 
                          (uint8_t)((mcast_ip & 0xff0000) >> 16),
                          (uint8_t)((mcast_ip & 0x00ff00) >>  8),
                          (uint8_t) (mcast_ip & 0x0000ff) };
  enet_send_udp_ucast(dest_mac, mcast_ip, mcast_port,
                      ETH_IP_ADDR, mcast_port,
                      payload, payload_len);
}

void enet_send_udp_ucast(const uint8_t *dest_mac,
                         const uint32_t dest_ip, const uint16_t dest_port,
                         const uint32_t source_ip, const uint16_t source_port,
                         const uint8_t *payload, const uint16_t payload_len)
{
  eth_udp_header_t *h = (eth_udp_header_t *)&g_eth_udpbuf[0];  
  for (int i = 0; i < 6; i++)
  {
    h->ip.eth.dest_addr[i] = dest_mac[i];
    h->ip.eth.source_addr[i] = s_enet_mac[i];
  }
  h->ip.eth.ethertype = eth_htons(ETH_ETHERTYPE_IP);
  h->ip.header_len = ETH_IP_HEADER_LEN;
  h->ip.version = ETH_IP_VERSION; // ipv4
  h->ip.ecn = 0;
  h->ip.diff_serv = 0;
  h->ip.len = eth_htons(20 + 8 + payload_len);
  h->ip.id = 0;
  h->ip.flag_frag = eth_htons(ETH_IP_DONT_FRAGMENT);
  h->ip.ttl = 1; // not sure here...
  h->ip.proto = ETH_IP_PROTO_UDP;
  h->ip.checksum = 0; // will be filled by the ethernet TX machinery
  h->ip.dest_addr = eth_htonl(dest_ip);
  h->ip.source_addr = eth_htonl(source_ip); //); // todo: something else
  h->dest_port = eth_htons(dest_port);
  h->source_port = eth_htons(source_port); //1234;
  h->len = eth_htons(8 + payload_len);
  h->checksum = 0; // will be filled by the ethernet TX machinery
  memcpy(g_eth_udpbuf + sizeof(eth_udp_header_t), payload, payload_len);
  eth_send_raw_packet(g_eth_udpbuf, sizeof(eth_udp_header_t) + payload_len);
  /*
  uint8_t raw_test_pkt[128] = 
  { 0x01, 0x00, 0x5e, 0x00, 0x00, 0x7b, 0x90, 0x2b,
    0x34, 0x39, 0xb3, 0x2e, 0x08, 0x00, 0x45, 0x00,
    0x00, 0x2b, 0x00, 0x00, 0x40, 0x00, 0x01, 0x11,
    0xd7, 0x1e, 0xc0, 0xa8, 0x01, 0x80, 0xe0, 0x00,
    0x00, 0x7b, 0xcc, 0xad, 0x04, 0xd4, 0x00, 0x17,
    0x00, 0x00, 0x01, 0x01, 0x00, 0x0b, 0x00, 0x00,
    0x08, 0xca, 0xfe, 0xbe, 0xef, 0x12, 0x34, 0x56,
    0x78, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x7b, 0x94, 0x60, 0x0f };
  eth_send_raw_packet(raw_test_pkt, 68); //sizeof(reg_idx) + payload_len);
  */
}

uint_fast8_t enet_process_rx_ring()
{
  uint_fast8_t num_pkts_rx = 0;
  while (g_eth_rxpool_ptrs_wpos != g_eth_rxpool_ptrs_rpos)
  {
    const uint16_t rp = g_eth_rxpool_ptrs_rpos;
    const uint8_t *start = (const uint8_t *)g_eth_rxpool_start[rp];
    const uint16_t len = g_eth_rxpool_len[rp];
    //printf("eth rxpool wpos = %d rpos = %d start %d len %d\r\n",
    //       g_eth_rxpool_ptrs_wpos,
    //       rp, start - g_eth_rxpool, len);
    // see if it's addressed to us
    const eth_eth_header_t *e = (const eth_eth_header_t *)start;
    uint8_t unicast_match = 1, multicast_match = 1, broadcast_match = 1;
    /*
    printf("rx mac: %02x:%02x:%02x:%02x:%02x:%02x\r\n",
           e->dest_addr[0], e->dest_addr[1], e->dest_addr[2],
           e->dest_addr[3], e->dest_addr[4], e->dest_addr[5]);
    */
    for (int i = 0; i < 6; i++)
    {
      if (e->dest_addr[i] != s_enet_mac[i])
        unicast_match = 0;
      if (e->dest_addr[i] != 0xff)
        broadcast_match = 0;
    }
    if (e->dest_addr[0] != 0x01 ||
        e->dest_addr[1] != 0x00 ||
        e->dest_addr[2] != 0x5e)
      multicast_match = 0;
    //printf("  ucast_match = %d, bcast_match = %d, mcast_match = %d\r\n",
    //       unicast_match, broadcast_match, multicast_match);
    //printf("dispatch @ %8u\r\n", (unsigned)SYSTIME);
    if (unicast_match || multicast_match || broadcast_match)
      num_pkts_rx += eth_dispatch_eth(start, len) ? 1 : 0;
    if (++g_eth_rxpool_ptrs_rpos >= ETH_RAM_RXPOOL_NPTR)
      g_eth_rxpool_ptrs_rpos = 0;
  }
  return num_pkts_rx;
}

static bool eth_dispatch_eth(const uint8_t *data, const uint16_t len)
{
  // dispatch according to protocol
  pin_toggle_state(GPIOE, PORTE_ETH_YELLOW_LED);
  const eth_eth_header_t *e = (const eth_eth_header_t *)data;
  switch (eth_htons(e->ethertype))
  {
    case ETH_ETHERTYPE_IP:
      return eth_dispatch_ip(data, len);
    case ETH_ETHERTYPE_ARP:
      return eth_dispatch_arp(data, len);
    default:
      return false;
  }
}

static void enet_add_ip_header_checksum(eth_ip_header_t *ip)
{
  ip->checksum = 0;
  uint32_t sum = 0;
  for (int word_idx = 0; word_idx < 10; word_idx++)
  {
    uint16_t word = *((uint16_t *)ip + sizeof(eth_eth_header_t)/2 + word_idx);
    word = eth_htons(word);
    sum += word;
    //printf("word %d: 0x%02x\r\n", word_idx, word);
  }
  sum += (sum >> 16);
  sum &= 0xffff;
  ip->checksum = (uint16_t)eth_htons(~sum);
  //printf("ip header checksum: 0x%04x\r\n", ip->ip_checksum);
}

static bool eth_dispatch_icmp(uint8_t *data, const uint16_t len)
{
  //leds_toggle(LEDS_YELLOW);
  //printf("enet_icmp_rx\r\n");
  enet_icmp_header_t *icmp = (enet_icmp_header_t *)data;
  if (icmp->type != ENET_ICMP_ECHO_REQUEST)
    return false;
  static const int ENET_ICMP_RESPONSE_MAX_LEN = 300; // i have no idea
  uint8_t icmp_response_buf[ENET_ICMP_RESPONSE_MAX_LEN];
  uint16_t incoming_ip_len = eth_htons(icmp->ip.len);
  uint16_t icmp_data_len = incoming_ip_len - 20 - 8; // everything after icmp
  if (icmp_data_len > ENET_ICMP_RESPONSE_MAX_LEN - sizeof(enet_icmp_header_t))
    icmp_data_len = ENET_ICMP_RESPONSE_MAX_LEN - sizeof(enet_icmp_header_t);
  enet_icmp_header_t *icmp_response = (enet_icmp_header_t *)icmp_response_buf;
  for (int i = 0; i < 6; i++)
  {
    icmp_response->ip.eth.dest_addr[i]   = icmp->ip.eth.source_addr[i];
    icmp_response->ip.eth.source_addr[i] = s_enet_mac[i];
  }
  icmp_response->ip.eth.ethertype = eth_htons(ETH_ETHERTYPE_IP);
  icmp_response->ip.header_len = ETH_IP_HEADER_LEN;
  icmp_response->ip.version = ETH_IP_VERSION;
  icmp_response->ip.ecn = 0;
  icmp_response->ip.diff_serv = 0;
  icmp_response->ip.len = eth_htons(incoming_ip_len);
  icmp_response->ip.id = 0;
  icmp_response->ip.flag_frag = eth_htons(ETH_IP_DONT_FRAGMENT);
  icmp_response->ip.ttl = icmp->ip.ttl;
  icmp_response->ip.proto = ETH_IP_PROTO_ICMP;
  icmp_response->ip.checksum = 0;
  icmp_response->ip.source_addr = eth_htonl(ETH_IP_ADDR);
  icmp_response->ip.dest_addr = icmp->ip.source_addr;
  icmp_response->type = ENET_ICMP_ECHO_REPLY;
  icmp_response->code = 0;
  icmp_response->checksum = 0;
  icmp_response->id = icmp->id;
  icmp_response->sequence = icmp->sequence;
  enet_add_ip_header_checksum(&icmp_response->ip);
  uint8_t *icmp_response_payload = icmp_response_buf + sizeof(enet_icmp_header_t);
  uint8_t *icmp_request_payload = data + sizeof(enet_icmp_header_t);
  for (int i = 0; i < icmp_data_len; i++)
    icmp_response_payload[i] = icmp_request_payload[i];
  uint32_t csum = 0;
  for (int word_idx = 0; word_idx < 4 + icmp_data_len / 2; word_idx++)
  {
    uint16_t word = *((uint16_t *)icmp_response + sizeof(eth_ip_header_t)/2 +
                      word_idx);
    word = eth_htons(word);
    csum += word;
  }
  csum += (csum >> 16);
  csum &= 0xffff;
  icmp_response->checksum = eth_htons(~csum);
  eth_send_raw_packet(icmp_response_buf, 
                      sizeof(enet_icmp_header_t) + icmp_data_len);
  return true;
}

static bool eth_dispatch_arp(const uint8_t *data, const uint16_t len)
{
  eth_arp_pkt_t *arp_pkt = (eth_arp_pkt_t *)data;
  if (eth_htons(arp_pkt->hw_type) != ETH_ARP_HW_ETHERNET ||
      eth_htons(arp_pkt->proto_type) != ETH_ARP_PROTO_IPV4)
  {
    printf("unknown ARP hw type (0x%x) or protocol type (0x%0x)\r\n",
        eth_htons(arp_pkt->hw_type), eth_htons(arp_pkt->proto_type));
    return false; // this function only handles ARP for IPv4 over ethernet
  }
  uint16_t op = eth_htons(arp_pkt->operation);
  if (op == ETH_ARP_OP_REQUEST)
  {
    int req_ip = eth_htonl(arp_pkt->target_proto_addr);
    if (req_ip != ETH_IP_ADDR)
    {
      //printf("ignoring ARP request for 0x%08x\r\n", req_ip);
      return false;
    }
    //printf("request for 0x%08x\r\n", req_ip);
    //const uint8_t *request_eth_addr = arp_pkt->sender_hw_addr;
    //const uint32_t *request_ip = htonl(arp_pkt->sender_proto_addr);
    eth_arp_pkt_t response;
    for (int i = 0; i < 6; i++)
    {
      response.eth.dest_addr[i]   = arp_pkt->sender_hw_addr[i];
      response.eth.source_addr[i] = s_enet_mac[i];
      response.sender_hw_addr[i]  = s_enet_mac[i];
      response.target_hw_addr[i]  = arp_pkt->sender_hw_addr[i];
    }
    response.eth.ethertype = eth_htons(ETH_ETHERTYPE_ARP);
    response.sender_proto_addr = eth_htonl(ETH_IP_ADDR);
    response.target_proto_addr = arp_pkt->sender_proto_addr;
    response.hw_type = eth_htons(ETH_ARP_HW_ETHERNET);
    response.proto_type = eth_htons(ETH_ARP_PROTO_IPV4);
    response.hw_addr_len = 6; // ethernet address length
    response.proto_addr_len = 4; // IPv4 address length
    response.operation = eth_htons(ETH_ARP_OP_RESPONSE);
    eth_send_raw_packet((uint8_t *)&response, sizeof(response));
    return true;
  }
  else if (op == ETH_ARP_OP_RESPONSE)
  {
    printf("arp response rx\r\n");
    if (arp_pkt->sender_proto_addr == eth_htonl(g_host_ip_addr))
    {
      for (int i = 0; i < 6; i++)
        g_enet_master_mac[i] = arp_pkt->sender_hw_addr[i];
      printf("master MAC: %02x:%02x:%02x:%02x:%02x:%02x\r\n",
             g_enet_master_mac[0], g_enet_master_mac[1],
             g_enet_master_mac[2], g_enet_master_mac[3],
             g_enet_master_mac[4], g_enet_master_mac[5]);
      g_enet_arp_valid = true;
    }
    return true;
  }
  return false;
}

static bool eth_dispatch_ip(const uint8_t *data, const uint16_t len)
{
  const eth_ip_header_t *ip = (const eth_ip_header_t *)data;
  if (ip->version != 4) // we only handle ipv4 (for now...)
    return false;
  // if it's unicast, verify our IP address, otherwise ignore the packet
  if (ip->eth.dest_addr[0] == s_enet_mac[0]) // todo: smarter MAC filter.
    if (ip->dest_addr != eth_htonl(ETH_IP_ADDR))
      return false;
  if (ip->proto == ETH_IP_PROTO_UDP)
    return eth_dispatch_udp(data, len);
  else if (ip->proto == ETH_IP_PROTO_ICMP)
    return eth_dispatch_icmp((uint8_t *)data, len);
  return false; // if we get here, we aren't smart enough to handle this packet
}

