ros2/freertps/stm32/enet.c
static bool eth_dispatch_udp(const uint8_t *data, const uint16_t len)
{
  const eth_udp_header_t *udp = (const eth_udp_header_t *)data;
  const uint16_t port = eth_htons(udp->dest_port);
  const uint16_t payload_len = eth_htons(udp->len) - 8;
  const uint8_t *payload = data + sizeof(eth_udp_header_t);
  //printf("  udp len: %d\r\n", udp_payload_len);
  if (payload_len > len - sizeof(eth_udp_header_t))
    return false; // ignore fragmented UDP packets.
  //printf("dispatch udp @ %8u\r\n", (unsigned)SYSTIME);

  //printf("dispatch udp: port = %d  payload_len = %d\r\n", port, payload_len);
  /*
  for (int i = 0; i < payload_len; i++)
  {
    printf("  %02d: %02x\r\n", i, payload[i]);
  }
  */
#if 0
  if (port == 11333 && payload_len > 0)
  {
    const uint8_t cmd = payload[0];
    if (cmd == 1 && payload_len >= 3)
    {
      const uint8_t port = payload[1];
      const uint8_t on = payload[2];
      power_set(port, on);
    }
    else if (cmd == 2 && payload_len >= 6) // set dmxl registers
    {
      /*
      const uint8_t port = payload[1];
      const uint8_t id = payload[2];
      const uint8_t start_addr = payload[3];
      const uint8_t num_regs = payload[4];
      const uint8_t *regs = &payload[5];
      dmxl_set_regs(port, id, start_addr, num_regs, regs);
      */
    }
#endif
#if 0
    //printf("  enet rx cmd = 0x%02x\r\n", cmd);
    {
      /*
      printf("    modes: %d %d %d %d\r\n", 
             payload[1], payload[2], payload[3], payload[4]);
      */
      for (int i = 0; i < NUM_DMXL; i++)
        dmxl_set_control_mode(i, (dmxl_control_mode_t)payload[1+i]);
      delay_ms(1); // be sure they control mode messages get through
      return true;
    }
    else if (cmd == 2 && payload_len >= 9)
    {
      uint16_t targets[NUM_DMXL];
      for (int i = 0; i < NUM_DMXL; i++)
        targets[i] = (payload[1+2*i] << 8) | payload[2+2*i];
      /*
      printf("targets: %06d %06d %06d %06d\r\n", 
             targets[0], targets[1], targets[2], targets[3]);
      */
      /*
      for (int i = 0; i < NUM_DMXL; i++)
        dmxl_set_control_target(i, targets[i]);
      */
      dmxl_set_all_control_targets(targets);
      //dmxl_set_control_target(0, targets[0]); // debugging... just do #0
      return true;
    }
#endif
  // if we get here, we haven't handled this packet
  return false;
}

// todo: be smarter about multicast group choice
#define MCAST_IP 0xe000008e

#if 0
void enet_tx_state()
{
  //printf("%d enet_tx_state()\r\n", (int)SYSTIME);
  //volatile state_t tx_state = g_state; // make a local copy to ensure coherence
  //uint8_t fake_state[8] = {0};
  g_state.time_us = SYSTIME;
  g_state.channels_active = power_get_state();
  enet_send_udp_mcast(MCAST_IP, 11333,
                      (uint8_t *)&g_state, sizeof(g_state));
}
#endif

#if 0
void enet_systick()
{
  static int s_enet_systick_count = 0;
  if (++s_enet_systick_count % 2000 == 0 &&
      enet_get_link_status() == ENET_LINK_UP)
  {
    if (!enet_master_mac_valid())
    {
      //enet_request_master_mac();
    }
    //printf("enet 1hz systick\r\n");
  }
}
#endif

